
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	 
	ПериодРеквизит = Новый РеквизитФормы("ПериодДействия", Новый ОписаниеТипов("СтандартныйПериод"), , "Период действия");
	ДобавляемыеРеквизиты.Добавить(ПериодРеквизит);
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	 
	
	ЭлементПериодДействия = Элементы.Добавить("ПериодДействия", Тип("ПолеФормы"));
	ЭлементПериодДействия.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементПериодДействия.ПутьКДанным = "ПериодДействия";
	ЭлементПериодДействия.Видимость = Ложь;
	
	ЭлементАбонентскаяПлата = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));
	ЭлементАбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементАбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлатаМесяц";
	ЭлементАбонентскаяПлата.Видимость = Ложь;
	
	ЭлементСтоимость = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимость.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементСтоимость.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	ЭлементСтоимость.Видимость = Ложь;
				
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ПериодДействия.Видимость = Истина;
		Элементы.АбонентскаяПлата.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ПериодДействия.Видимость = Ложь;
		Элементы.АбонентскаяПлата.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти









